---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.ConstructionType.ExteriorWall
enum: Autodesk.Revit.DB.Analysis.ConstructionType
source: html/5f6be035-3a2d-77ad-8402-4d6b87dec818.htm
---
# Autodesk.Revit.DB.Analysis.ConstructionType.ExteriorWall

An exterior wall surrounding the space